app/services/bank_operations.rb

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "balances".* FROM "balances" WHERE "balances"."account_id" = $1 ORDER BY "balances"."id" DESC LIMIT $2  [["account_id", 1], ["LIMIT", 1]]
---
    def self.get_balance(account)
      balance = Account.find(account).try(:balances).try(:last).try(:amount)

INSERT INTO "transfers" ("account_id", "amount", "account_to", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_id", 1], ["amount", "500.0"], ["account_to", 1], ["created_at", "2021-05-31 19:43:44.589610"], ["updated_at", "2021-05-31 19:43:44.589610"]]
INSERT INTO "balances" ("account_id", "transfer_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_id", 1], ["transfer_id", 2], ["amount", "1127.0"], ["created_at", "2021-05-31 19:43:44.598362"], ["updated_at", "2021-05-31 19:43:44.598362"]]
---
    def self.increment(id, kind, amount)
      if kind == "Transfer"
        operation = Transfer.create(account_id: id, amount: amount, account_to: id)
      else
        operation = self.get_operation(id, kind)
      end
      last_balance = self.get_balance(operation.account.id)
      increment = operation.amount.to_f
      new_balance = last_balance + increment
      balance = operation.balances.create(
        account_id: operation.account.id,
        amount: new_balance
      )

INSERT INTO "balances" ("account_id", "transfer_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_id", 2], ["transfer_id", 1], ["amount", "995.0"], ["created_at", "2021-05-31 19:43:44.583280"], ["updated_at", "2021-05-31 19:43:44.583280"]]
---
    def self.decrement(id, kind, tax)
      operation = self.get_operation(id, kind)
      last_balance = self.get_balance(operation.account.id)
      decrement = operation.amount.to_f + tax
      new_balance = last_balance - decrement
      balance = operation.balances.create(
        account_id: operation.account.id,
        amount: new_balance
      )

SELECT  "deposits".* FROM "deposits" WHERE "deposits"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "withdraws".* FROM "withdraws" WHERE "withdraws"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "transfers".* FROM "transfers" WHERE "transfers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def self.get_operation(id, kind)
      case kind
        when "Deposit"
          operation = Deposit.find(id)
        when "Withdraw"
          operation = Withdraw.find(id)
        when "Transfer"
          operation = Transfer.find(id)