app/controllers/balance_controller.rb

SELECT "balances".* FROM "balances" WHERE "balances"."account_id" = $1 AND "balances"."created_at" BETWEEN $2 AND $3  [["account_id", 1], ["created_at", "2021-05-01"], ["created_at", "2021-05-25"]]
---
  def index
    if params[:start_date].present? && params[:end_date].present?
      @balances = current_user.account.balances.where(created_at: params[:start_date].to_date..params[:end_date].to_date)