app/controllers/deposits_controller.rb

  def create
    @deposit = current_user.account.deposits.new(deposit_params)
    respond_to do |format|
      if @deposit.save
---
INSERT INTO "deposits" ("account_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["account_id", 2], ["amount", "1500.0"], ["created_at", "2021-05-31 19:43:06.114172"], ["updated_at", "2021-05-31 19:43:06.114172"]]

  def destroy
    @deposit.destroy
---
DELETE FROM "deposits" WHERE "deposits"."id" = $1  [["id", 2]]

    def set_deposit
      @deposit = Deposit.find(params[:id])
---
SELECT  "deposits".* FROM "deposits" WHERE "deposits"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]