app/controllers/transfers_controller.rb

  def index
    @transfers = Transfer.all
---
SELECT "transfers".* FROM "transfers"