app/controllers/transfers_controller.rb

  def create
    @transfer = current_user.account.transfers.new(transfer_params)
    @deposit.amount = normalize_money(deposit_params[:amount])
    respond_to do |format|
      if @transfer.save
---
INSERT INTO "transfers" ("account_id", "amount", "account_to", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_id", 3], ["amount", "1452.88"], ["account_to", 1], ["created_at", "2021-06-02 03:36:18.787843"], ["updated_at", "2021-06-02 03:36:18.787843"]]

    def verify_transfer
      account_to = Account.find_by(id: transfer_params[:account_to].to_i)
---
SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_transfer
      @transfer = Transfer.find(params[:id])
---
SELECT  "transfers".* FROM "transfers" WHERE "transfers"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]