app/controllers/withdraws_controller.rb

INSERT INTO "withdraws" ("account_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["account_id", 3], ["amount", "1500.0"], ["created_at", "2021-06-02 01:22:39.792109"], ["updated_at", "2021-06-02 01:22:39.792109"]]
---
  def create
    @withdraw = current_user.account.withdraws.new(withdraw_params)

    respond_to do |format|
      if @withdraw.save

UPDATE "withdraws" SET "amount" = $1, "updated_at" = $2 WHERE "withdraws"."id" = $3  [["amount", "10.0"], ["updated_at", "2021-05-29 23:35:22.064745"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @withdraw.update(withdraw_params)

DELETE FROM "withdraws" WHERE "withdraws"."id" = $1  [["id", 1]]
---
  def destroy
    @withdraw.destroy

SELECT  "withdraws".* FROM "withdraws" WHERE "withdraws"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def set_withdraw
      @withdraw = Withdraw.find(params[:id])