app/models/account.rb

	def get_balance
		balance = self.try(:balances).try(:last).try(:amount)
		if balance.present?
---
SELECT  "balances".* FROM "balances" WHERE "balances"."account_id" = $1 ORDER BY "balances"."id" DESC LIMIT $2  [["account_id", 1], ["LIMIT", 1]]