app/models/balance.rb

  def get_type
    if self.withdraw.present?
      transaction_type = "Saque"
    elsif self.deposit.present?
      transaction_type = "Depósito"
    elsif self.transfer.present?
---
SELECT  "withdraws".* FROM "withdraws" WHERE "withdraws"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "deposits".* FROM "deposits" WHERE "deposits"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "transfers".* FROM "transfers" WHERE "transfers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]