app/models/deposit.rb

  def increment_balance
    last_balance = self.account.get_balance
    increment = self.amount.to_f
    new_balance = last_balance + increment
    balance = self.balances.create(
      account_id: self.account.id,
      amount: new_balance
    )
---
INSERT INTO "balances" ("account_id", "deposit_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["account_id", 1], ["deposit_id", 1], ["amount", "500.0"], ["created_at", "2021-05-26 15:28:19.153184"], ["updated_at", "2021-05-26 15:28:19.153184"]]