app/models/user.rb

INSERT INTO "accounts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 2], ["created_at", "2021-05-31 19:42:51.752491"], ["updated_at", "2021-05-31 19:42:51.752491"]]
---
  def create_account
     Account.create(user_id: self.id)